---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceAnisotropy
source: html/3ae47923-787f-4e00-efb1-34122688ad2f.htm
---
# Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceAnisotropy Property

The property labeled "Anisotropy" from the "AdvancedMetal" schema.

## Syntax (C#)
```csharp
public static string SurfaceAnisotropy { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.